import pandas as pd

print("Информация о кабинетах")

class_card = {
        'ID': ['1', '2', '3', '4', '5'],
        'Предмет': ['Математика', 'Русский язык', 'Химия', 'Биология', 'Физика'],
        '№ парты': ['1', '2', '3', '4', '5'],
        'Ряд': ['Первый', 'Второй', 'Третий', 'Четвертый', 'Пятый'],
        'Вид парты': ['Одноместная', 'Одноместная', 'Двухместная', 'Двухместная', 'Одноместная']
}

cab = pd.DataFrame(data = class_card)

with open('cabinet.csv', 'a', encoding='UTF-8') as c:
    c.write(f'{cab}')
    c.write('\n')

print(cab)