import pandas as pd

print('Информация о студентах')

study_card = {
        'ID': ['01','02','03','04','05'],
        'Имя': ['Дмитрий','Василий','Иван','Света','Дарья'],
        'Фамилия': ['Петров','Иванов','Литвинов','Маслова','Скрябнева'],
        'Дата рождения': ['11.06.2000','04.04.2001','08.08.2000','15.01.2002','24.11.2002'],
        'Успеваемость': ['Отличник','Ударник','Хорошист','Отличник','Отличник']
}

stud = pd.DataFrame(data = study_card)

with open('student.csv', 'a', encoding='UTF-8') as c:
    c.write(f'{stud}')
    c.write('\n')

print(stud)